music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    debugger

    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["year", 1989], ["band_id", 8], ["created_at", "2018-11-16 01:26:01.823221"], ["updated_at", "2018-11-16 01:26:01.823221"]]

  def update
    @album = Album.find(params[:id])


    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", false], ["updated_at", "2018-11-16 01:27:45.786495"], ["id", 3]]